---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.AnalyticalModelFloorAlignmentMethod
source: html/0613d978-2902-0d98-08e2-318e051cdfad.htm
---
# Autodesk.Revit.DB.ParameterTypeId.AnalyticalModelFloorAlignmentMethod Property

"Alignment Method"

## Syntax (C#)
```csharp
public static ForgeTypeId AnalyticalModelFloorAlignmentMethod { get; }
```